app/controllers/meetings_controller.rb

  def show
    @meetings = Meeting.all
---
SELECT "meetings".* FROM "meetings"

  def destroy
    Meeting.find(params[:id]).destroy
---
DELETE FROM "meetings" WHERE "meetings"."id" = $1  [["id", 1]]
SELECT "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    # binding.pry
    @meeting = Meeting.new(meeting_params)
    @meeting.name = current_user.nome
    @meeting.user_id = current_user.id
    @meeting.save
---
INSERT INTO "meetings" ("name", "start_time", "end_time", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"