app/controllers/pages_controller.rb

  def home
    # Scope your query to the dates being shown:

    start_date = params.fetch(:start_date, Date.today).to_date
    @data_inicio = start_date.beginning_of_month.beginning_of_week..start_date.end_of_month.end_of_week
    #binding.pry
    # For a monthly view:
    @meetings = Meeting.where( start_time: @data_inicio )
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."start_time" BETWEEN $1 AND $2  [["start_time", "2021-12-27"], ["start_time", "2022-02-06"]]